app/Http/Controllers/DashboardController.php

    public function index()
    {
        // mengambil semua data artikel
        $artikel = Artikel::all();
---
select * from `artikel`