app/Http/Controllers/Admin/ArtikelController.php

    public function index()
    {
        // mengambil semua data artikel
        // Eloquent ORM
        // select * from artikel
        $artikel = Artikel::all();
---
select * from `artikel`

    public function store(Request $request)
    {
        // ambil request thumbnail dari form pindahkan ke folder public/thumbnail
        $request->thumbnail->move(public_path('thumbnail'), $request->thumbnail->getClientOriginalName());
        // membuat slug dari judul
        $slug = Str::slug($request->judul, '-');
        // simpan ke dalam database
        Artikel::create([
            'judul' => $request->judul,
            'tanggal' => $request->tanggal,
            'thumbnail' => $request->thumbnail->getClientOriginalName(),
            'slug' => $slug,
            'isi' => $request->isi,
        ]);
---
insert into `artikel` (`judul`, `tanggal`, `thumbnail`, `slug`, `isi`, `updated_at`, `created_at`) values ('Belajar laravel', '2023-09-09', 'yt.png', 'belajar-laravel', '<p>Coba aja</p>', '2023-09-08 13:54:29', '2023-09-08 13:54:29')

    public function show(string $id)
    {
        // mencari data artikel berdasarkan id
        $artikel = Artikel::find($id);
---
select * from `artikel` where `artikel`.`id` = '4' limit 1

    public function update(Request $request, string $id)
    {
        // mencari data artikel berdasarkan id
        $artikel = Artikel::find($id);
---
select * from `artikel` where `id` in ('2')

    public function destroy(string $id)
    {
        // hapus artikel berdasarkan id
        Artikel::destroy($id);
---
delete from `artikel` where `id` = 4